configuration/src/Documents/Трудозатраты/Трудозатраты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Трудозатраты</name>
  <registerRecords>AccumulationRegister.ОказанныеУслуги</registerRecords>
  <registerRecords>InformationRegister.Трудозатраты</registerRecords>
  <attributes>
    <name>ITСтруктура</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДеятельности</name>
    <type>
      <types>CatalogRef.ВидыДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>Затрата</name>
    <comment>Затраченное время в часах</comment>
    <type>
      <types>DefinedType.Трудозатрата</types>
    </type>
  </attributes>
  <attributes>
    <name>ИзменениеЗапрещено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Направление</name>
    <type>
      <types>CatalogRef.НаправленияРазработки</types>
    </type>
  </attributes>
  <attributes>
    <name>Объект</name>
    <type>
      <types>DefinedType.ОбъектТрудозатрат</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Услуга</name>
    <type>
      <types>CatalogRef.Услуги</types>
    </type>
  </attributes>
  <attributes>
    <name>Филиал</name>
    <comment>Филиал пользователя на момент занесения трудозатрат</comment>
    <type>
      <types>CatalogRef.Филиалы</types>
    </type>
  </attributes>
  <attributes>
    <name>ЮридическоеЛицо</name>
    <comment>Юридическое лицо объекта (или родительской заявки)</comment>
    <type>
      <types>CatalogRef.ЮридическиеЛица</types>
    </type>
  </attributes>
</mdclass:Document>

configuration/src/InformationRegisters/СтоимостьУслуг/СтоимостьУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтоимостьУслуг</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>17</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДобавления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>Услуга</name>
    <type>
      <types>CatalogRef.Услуги</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЮридическоеЛицо</name>
    <type>
      <types>CatalogRef.ЮридическиеЛица</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

configuration/src/InformationRegisters/СвязьОбъектовСЗаявкамиНаРазработку/СвязьОбъектовСЗаявкамиНаРазработку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СвязьОбъектовСЗаявкамиНаРазработку</name>
  <resources>
    <name>Заявка</name>
    <type>
      <types>DocumentRef.ЗаявкаНаРазработку</types>
    </type>
  </resources>
  <attributes>
    <name>ОбъектОснование</name>
    <type>
      <types>DocumentRef.ВнутреннееЗадание</types>
      <types>CatalogRef.Проекты</types>
      <types>DocumentRef.Задача</types>
      <types>DocumentRef.ЗаявкаНаРазработку</types>
    </type>
  </attributes>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>DocumentRef.ВнутреннееЗадание</types>
      <types>CatalogRef.Проекты</types>
      <types>DocumentRef.Задача</types>
      <types>DocumentRef.ЗаявкаНаРазработку</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Заявка_Новая</name>
    <type>
      <types>DocumentRef.ЗаявкаНаРазработку</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

configuration/src/InformationRegisters/Трудозатраты/Трудозатраты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Трудозатраты</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Затрата</name>
    <type>
      <types>DefinedType.Трудозатрата</types>
    </type>
  </resources>
  <attributes>
    <name>ITСтруктура</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДеятельности</name>
    <type>
      <types>CatalogRef.ВидыДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>РольПользователя</name>
    <type>
      <types>CatalogRef.РолиПользователей</types>
    </type>
  </attributes>
  <attributes>
    <name>Услуга</name>
    <type>
      <types>CatalogRef.Услуги</types>
    </type>
  </attributes>
  <attributes>
    <name>Филиал</name>
    <type>
      <types>CatalogRef.Филиалы</types>
    </type>
  </attributes>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>DefinedType.ОбъектТрудозатрат</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

configuration/src/AccumulationRegisters/ОказанныеУслуги/ОказанныеУслуги.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОказанныеУслуги</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Количество</name>
    <type>
      <types>DefinedType.Трудозатрата</types>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>17</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>17</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоследнегоПроведения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>Направление</name>
    <type>
      <types>CatalogRef.НаправленияРазработки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЮридическоеЛицо</name>
    <type>
      <types>CatalogRef.ЮридическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Услуга</name>
    <type>
      <types>CatalogRef.Услуги</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъектОснование</name>
    <type>
      <types>DocumentRef.ВнутреннееЗадание</types>
      <types>CatalogRef.Проекты</types>
      <types>DocumentRef.ЗаявкаНаРазработку</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Филиал</name>
    <type>
      <types>CatalogRef.Филиалы</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

configuration/src/InformationRegisters/РаспределенныеТрудозатраты/РаспределенныеТрудозатраты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РаспределенныеТрудозатраты</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>ДокументТрудозатрат</name>
    <type>
      <types>DocumentRef.Трудозатраты</types>
    </type>
  </resources>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВнесения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>Филиал</name>
    <type>
      <types>CatalogRef.Филиалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>DefinedType.ОбъектТрудозатрат</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

configuration/src/InformationRegisters/ОчередьСобытийНаОбработку/ОчередьСобытийНаОбработку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОчередьСобытийНаОбработку</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Данные</name>
    <comment>Данные события в формате JSON</comment>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <attributes>
    <name>Автор</name>
    <comment>Пользователь, инициировавший данное событие</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСобытия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОбработки</name>
    <comment>Дата обработки события</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерПотока</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Обработано</name>
    <comment>Признак успешной обработки события</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РезультатОбработки</name>
    <comment>Строка с описанием ошибки обработки</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>Объект</name>
    <comment>Объект, к которому относится событие</comment>
    <type>
      <types>CatalogRef.Должности</types>
      <types>CatalogRef.Пользователи</types>
      <types>CatalogRef.Филиалы</types>
      <types>DocumentRef.Спринт</types>
      <types>DocumentRef.ВнутреннееЗадание</types>
      <types>DocumentRef.ВнутренниеТрудозатраты</types>
      <types>DocumentRef.ОбработкаЭскалацииОшибок</types>
      <types>CatalogRef.Продукты</types>
      <types>CatalogRef.Проекты</types>
      <types>CatalogRef.КарточкаКанбан</types>
      <types>CatalogRef.Процессы</types>
      <types>DocumentRef.Задача</types>
      <types>DocumentRef.ЗаявкаНаРазработку</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипСобытия</name>
    <type>
      <types>EnumRef.ТипыСобытийОчереди</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КлючСобытия</name>
    <comment>Для обеспечения уникальности записей</comment>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

configuration/src/Enums/ТипыФилиалов/ТипыФилиалов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыФилиалов</name>
  <enumValues>
    <name>IT</name>
  </enumValues>
  <enumValues>
    <name>НеIT</name>
  </enumValues>
  <enumValues>
    <name>QA</name>
  </enumValues>
</mdclass:Enum>

configuration/src/Documents/Трудозатраты/ObjectModule.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО ДНС Технологии
// SDMS (Software Development Management System) — это корпоративная система учета разработки и управления проектами 
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии General Public License (GNU GPL v3)
// Текст лицензии доступен по ссылке:
// https://www.gnu.org/licenses/gpl-3.0.html
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер ИЛИ ВнешнееСоединение ИЛИ ТолстыйКлиентОбычноеПриложение Тогда

#Область ОписаниеПеременных

// Управляет проверкой запрета на изменение объекта 
// (реквизит ИзменениеЗапрещено и проверка даты запрета изменения)
Перем ОтключитьПроверкуЗапретаИзменения Экспорт;

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ИзменениеЗапрещено И НЕ ОтключитьПроверкуЗапретаИзменения Тогда  
		ВызватьИсключение "Документ недоступен для изменения.";  
	КонецЕсли;  
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;	
	
	Если ДополнительныеСвойства.Свойство("Собрание") И ЗначениеЗаполнено(ДополнительныеСвойства.Собрание) Тогда	 
		ИнтеграцияДополнительныхПодсистем.ОбработатьСобраниеВТрудозатратах(ЭтотОбъект, ДополнительныеСвойства.Собрание, Объект);		    		
		ДополнительныеСвойства.Вставить("Объект", Объект);		
	ИначеЕсли НЕ ЗначениеЗаполнено(Объект) Тогда  
		ВызватьИсключение "Не заполнен ""Объект""";  
	КонецЕсли;
	
	ОбщегоНазначения.ПроверитьДатуЗапретаИзмененияДанных(Дата, ОтключитьПроверкуЗапретаИзменения);
	
	Если Ссылка.Пустая() Тогда
		Автор = ПараметрыСеанса.ТекущийПользователь;
		ЗаполнитьРеквизитыТрудозатраты(); 
	КонецЕсли;     
	
	ДанныеСсылки = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, "Затрата, Объект, Услуга, Дата");
	
	Цена = 0;
	ПредыдущаяСтоимость = 0;
	Стоимость = 0;
	Если ЗначениеЗаполнено(ЮридическоеЛицо) Тогда 
		Если ЗначениеЗаполнено(Услуга) Тогда
			Цена = РегистрыСведений.СтоимостьУслуг.ПолучитьСтоимость(Услуга, ЮридическоеЛицо, Дата); 
			Стоимость = Цена * Затрата;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ДанныеСсылки.Услуга) Тогда
			Если (ДанныеСсылки.Услуга = Услуга) И (ДанныеСсылки.Дата = Дата) Тогда
				ПредыдущаяЦена = Цена;
			Иначе
				ПредыдущаяЦена = РегистрыСведений.СтоимостьУслуг.ПолучитьСтоимость(ДанныеСсылки.Услуга, ЮридическоеЛицо, ДанныеСсылки.Дата);	
			КонецЕсли; 
			
			ПредыдущаяСтоимость = ПредыдущаяЦена * ДанныеСсылки.Затрата;
		КонецЕсли;
	КонецЕсли;
	
	ДополнительныеСвойства.Вставить("Цена", Цена);
	
	ДанныеПересчета = Новый Массив;
	
	Если РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда 
		Если Объект <> ДанныеСсылки.Объект Тогда
			ДанныеПересчета.Добавить(Новый Структура("Затрата, Стоимость, Объект", -Затрата, -Стоимость, ДанныеСсылки.Объект)); 
		Иначе
			ДанныеПересчета.Добавить(Новый Структура("Затрата, Стоимость, Объект", -Затрата, -Стоимость, Объект));
		КонецЕсли;
	ИначеЕсли Ссылка.Пустая() Тогда 
		ДанныеПересчета.Добавить(Новый Структура("Затрата, Стоимость, Объект", Затрата, Стоимость, Объект));
	ИначеЕсли РежимЗаписи = РежимЗаписиДокумента.Проведение И Объект <> ДанныеСсылки.Объект Тогда 
		// С одного документа убрать, на другой добавить
		ДанныеПересчета.Добавить(Новый Структура("Затрата, Стоимость, Объект", -Затрата, -Стоимость, ДанныеСсылки.Объект));
		ДанныеПересчета.Добавить(Новый Структура("Затрата, Стоимость, Объект", Затрата, Стоимость, Объект));
	ИначеЕсли НЕ Ссылка.Проведен И РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда 
		ДанныеПересчета.Добавить(Новый Структура("Затрата, Стоимость, Объект", Затрата, Стоимость, Объект));
	ИначеЕсли (Затрата <> ДанныеСсылки.Затрата) ИЛИ (Стоимость <> ПредыдущаяСтоимость) Тогда 
		ДанныеПересчета.Добавить(Новый Структура("Затрата, Стоимость, Объект", 
													Затрата - ДанныеСсылки.Затрата, Стоимость - ПредыдущаяСтоимость, Объект));
	КонецЕсли;
	
	ДополнительныеСвойства.Вставить("ДанныеПересчета", ДанныеПересчета); 
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ДанныеЗаполнения = Неопределено Тогда
		Дата = ТекущаяДатаСеанса();
		Автор = ПараметрыСеанса.ТекущийПользователь;
		Пользователь = ПараметрыСеанса.ТекущийПользователь;
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) <> Тип("Структура") Тогда
		ВызватьИсключение "Неверный тип данных заполнения";
	КонецЕсли;
	
	ТипИсточника = ТипЗнч(ДанныеЗаполнения);
	
	Если ТипИсточника = Тип("Структура") Тогда	
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
		
		Если ЗначениеЗаполнено(Объект) Тогда
			ТипОбъекта = ТипЗнч(Объект);
			
			Если ТипОбъекта = Тип("ДокументСсылка.Задача") Тогда
				// Получаем заявку к которой относится задача
				Заявка = РегистрыСведений.СвязьОбъектовСЗаявкамиНаРазработку.ПолучитьЗаявку(Объект);
				
				Если ЗначениеЗаполнено(Заявка) Тогда
					ЮридическоеЛицо = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Заявка, "ЮридическоеЛицо");
				КонецЕсли;	
			ИначеЕсли ТипОбъекта <> Тип("ДокументСсылка.ВнутренниеТрудозатраты") Тогда
				// Заполнение юридического лица не требуется только для внутренних трудозатрат
				ЮридическоеЛицо = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект, "ЮридическоеЛицо");
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
#Область Движения_Трудозатраты
	
	ДвиженияТрудозатрат = Движения.Трудозатраты;
	ДвиженияТрудозатрат.Очистить();
	ДвиженияТрудозатрат.Записывать = Истина;
	
	НоваяТрудозатрата = ДвиженияТрудозатрат.Добавить();
	НоваяТрудозатрата.Регистратор = Ссылка;
	НоваяТрудозатрата.Период = Дата;
	НоваяТрудозатрата.Объект = Объект;
	НоваяТрудозатрата.Затрата = Затрата;
	НоваяТрудозатрата.ВидДеятельности = ВидДеятельности;
	НоваяТрудозатрата.Пользователь = Пользователь;
	НоваяТрудозатрата.Комментарий = Комментарий;
	НоваяТрудозатрата.Услуга = Услуга;
	НоваяТрудозатрата.ITСтруктура = ITСтруктура;
	НоваяТрудозатрата.Автор = ПараметрыСеанса.ТекущийПользователь;
	НоваяТрудозатрата.ДатаИзменения = ТекущаяДатаСеанса();
	НоваяТрудозатрата.Филиал = Филиал;
	НоваяТрудозатрата.РольПользователя = Справочники.РолиПользователей.ПолучитьРольПользователя(Пользователь, Дата);
	
#КонецОбласти

#Область Движения_ОказанныеУслуги

	// Если заполнена услуга, юридическое лицо и трудозатраты относятся к задаче
	// или заявке, то нужно сделать движения по регистру накопления ОказанныеУслуги
	
	ДвиженияУслуг = Движения.ОказанныеУслуги;
	ДвиженияУслуг.Очистить();
	ДвиженияУслуг.Записывать = Истина;
	
	Если ЗначениеЗаполнено(ЮридическоеЛицо) И ЗначениеЗаполнено(Услуга) Тогда
		Если ТипЗнч(Объект) = Тип("ДокументСсылка.Задача") Тогда
			ОбъектОснование = РегистрыСведений.СвязьОбъектовСЗаявкамиНаРазработку.ПолучитьЗаявку(Объект);
		Иначе
			ОбъектОснование = Объект;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ОбъектОснование) Тогда
			Цена = ДополнительныеСвойства.Цена;
			
			Если Цена > 0 Тогда
				НоваяОказаннаяУслуга = ДвиженияУслуг.Добавить();
				НоваяОказаннаяУслуга.Регистратор = Ссылка;
				НоваяОказаннаяУслуга.Период = Дата;
				НоваяОказаннаяУслуга.Направление = Направление;
				НоваяОказаннаяУслуга.ЮридическоеЛицо = ЮридическоеЛицо;
				НоваяОказаннаяУслуга.Услуга = Услуга;
				НоваяОказаннаяУслуга.Исполнитель = Пользователь;
				НоваяОказаннаяУслуга.Филиал = Филиал;
				НоваяОказаннаяУслуга.ОбъектОснование = ОбъектОснование;
				НоваяОказаннаяУслуга.Количество = Затрата;
				НоваяОказаннаяУслуга.Цена = Цена;
				НоваяОказаннаяУслуга.Сумма = Затрата * Цена;
				НоваяОказаннаяУслуга.ДатаПоследнегоПроведения = ТекущаяДатаСеанса();
				НоваяОказаннаяУслуга.Автор = ПараметрыСеанса.ТекущийПользователь;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

#КонецОбласти

	ЗафиксироватьПересчетТрудозатрат();
	
	Если ДополнительныеСвойства.Свойство("Собрание") И ЗначениеЗаполнено(ДополнительныеСвойства.Собрание) Тогда	 
		ИнтеграцияДополнительныхПодсистем.СохранитьСобраниеВТрудозатратах(Ссылка, ДополнительныеСвойства.Собрание);		    		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ) 
	
	ЗафиксироватьПересчетТрудозатрат(); 
	РегистрыСведений.РаспределенныеТрудозатраты.Удалить(Ссылка);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьНаправление()
	
	Если ТипЗнч(Объект) <> Тип("ДокументСсылка.ВнутренниеТрудозатраты") Тогда
		Направление = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект, "Направление");
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьРеквизитыТрудозатраты()
	
	// Заполнение юридического лица
	Если НЕ ЗначениеЗаполнено(ЮридическоеЛицо) Тогда
		ЗаполнитьЮридическоеЛицо();
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Направление) Тогда
		ЗаполнитьНаправление();
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВЫРАЗИТЬ(ЛичныеДела.Данные КАК Справочник.Филиалы) КАК Филиал,
	|	ЛичныеДела.Сотрудник КАК Пользователь
	|ПОМЕСТИТЬ ФилиалИПользователь
	|ИЗ
	|	РегистрСведений.ЛичныеДела.СрезПоследних(
	|			&Дата,
	|			Сотрудник = &Пользователь
	|				И Событие = ЗНАЧЕНИЕ(Перечисление.СобытияПоЛичнымДелам.ПереведенВДругоеПодразделение)) КАК ЛичныеДела
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(Филиалы.ТипФилиала, ЗНАЧЕНИЕ(Перечисление.ТипыФилиалов.ПустаяСсылка)) КАК ТипФилиала,
	|	ФилиалИПользователь.Филиал КАК Филиал
	|ИЗ
	|	ФилиалИПользователь КАК ФилиалИПользователь
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК Пользователи
	|		ПО ФилиалИПользователь.Пользователь = Пользователи.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Филиалы КАК Филиалы
	|		ПО ФилиалИПользователь.Филиал = Филиалы.Ссылка";
	
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Запрос.УстановитьПараметр("Объект", Объект);
	Запрос.УстановитьПараметр("Дата", Дата);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		
		ITСтруктура = (Выборка.ТипФилиала <> Перечисления.ТипыФилиалов.НеIT);
		Филиал = Выборка.Филиал;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьЮридическоеЛицо()
	
	ТипОбъекта = ТипЗнч(Объект);
	
	Если ТипОбъекта = Тип("ДокументСсылка.Задача") Тогда
		ОбъектОснование = РегистрыСведений.СвязьОбъектовСЗаявкамиНаРазработку.ПолучитьЗаявку(Объект);
	ИначеЕсли ТипОбъекта <> Тип("ДокументСсылка.ВнутренниеТрудозатраты") Тогда 
		ОбъектОснование = Объект;
	Иначе
		ОбъектОснование = Неопределено;
	КонецЕсли;
	
	Если ОбъектОснование <> Неопределено Тогда
		ЮридическоеЛицо = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОбъектОснование, "ЮридическоеЛицо");
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗафиксироватьПересчетТрудозатрат()
	
	Если ДополнительныеСвойства.Свойство("ДанныеПересчета") Тогда
		Для Каждого Строка Из ДополнительныеСвойства.ДанныеПересчета Цикл		
			Если (Строка.Затрата <> 0) ИЛИ (Строка.Стоимость <> 0) Тогда				
				Данные = Новый Структура;
				Данные.Вставить("Затрата", Строка.Затрата);
				Данные.Вставить("Стоимость", Строка.Стоимость);
				РегистрыСведений.ОчередьСобытийНаОбработку.ПересчитатьФактическиеТрудозатраты(Строка.Объект, Данные);
			КонецЕсли;
		КонецЦикла;	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область Инициализация

ОтключитьПроверкуЗапретаИзменения = Ложь;

#КонецОбласти

#КонецЕсли
